app/Controllers/Product.php

SELECT *
FROM `products`
---
    public function index()
    {
        // Proteksi Login - Sebaiknya gunakan Filter CI4 untuk skala profesional,
        // namun saya pertahankan di sini sesuai kode asli Anda.
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $data = [
            'title'    => 'Manajemen Stok Produk',
            'products' => $this->productModel->findAll()
        ];